#+TITLE: BOO
** Deploying Postgres
#+begin_src shell :noweb yes
kubectl apply -f - << EOF
<<postgres-secret>>
---
<<postgres-deployment>>
EOF
#+end_src

#+RESULTS:
#+begin_example
secret/postgres-configuration created
persistentvolumeclaim/postgres-pvc created
statefulset.apps/postgres created
service/postgres created
#+end_example

** Pod
#+begin_src shell
kubectl get pod -l app=postgres
#+end_src

#+RESULTS:
#+begin_example
NAME         READY   STATUS    RESTARTS   AGE
postgres-0   1/1     Running   0          47s
#+end_example
** Service
#+begin_src shell
kubectl get service postgres
#+end_src

#+RESULTS:
#+begin_example
NAME       TYPE        CLUSTER-IP     EXTERNAL-IP   PORT(S)    AGE
postgres   ClusterIP   10.96.151.12   <none>        5432/TCP   74s
#+end_example

